
Функция ПростаяЗаписьJSON(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;			
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Данные);			
	Возврат ЗаписьJSON.Закрыть();  
	
КонецФункции 

//Процедура приводит значения в массиве соответствий к примитивному типу (строка) для передачи через JSON.
//Параметры: ИтоговыйМассив - массив, содержащий соответствия с данными объектов
//			 ЛТЗ - таблица значений, которая имеет описание всех свойств объектов
Процедура ПривестиКПримитивномуТипу(ИтоговыйСтруктура, ЛТЗ) Экспорт
	МассивТиповТЗ = новый Массив;
	МассивТиповТЗ.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТиповТЗ = Новый ОписаниеТипов(МассивТиповТЗ);
	
	Для каждого Элем из ИтоговыйСтруктура цикл
		Для каждого Подэлем из ЛТЗ.Колонки цикл
			Если Подэлем.ТипЗначения <> ОписаниеТиповТЗ  тогда
				Элем.Значение[Подэлем.Имя]= Строка(Элем.Значение[Подэлем.Имя]);
			Иначе  
				МассивСоответствийСтрокТЗ = новый Массив;
				
				Для каждого СтрокаТЗ из  Элем.Значение[Подэлем.Имя] цикл
					СлепокСтруктуры 				= новый Структура;  

					СтруктураКолонокНоменклатуры= новый Структура;
					
					Для каждого Колонка из Элем.Значение[Подэлем.Имя].Колонки цикл
						СлепокСтруктуры.Вставить(Колонка.Имя, ); 
						Если СтрНайти(Колонка.Имя, "Номенклатура") <> 0 тогда
							СтруктураКолонокНоменклатуры.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
						КонецЕсли;							
					КонецЦикла; 
					
					Для каждого Номенклатура из СтруктураКолонокНоменклатуры цикл
						СлепокСтруктуры.Вставить(СтрШаблон("%1_артикул", Номенклатура.Ключ), Номенклатура.Значение.Артикул);
					КонецЦикла;
					
					ЗаполнитьЗначенияСвойств(СлепокСтруктуры, СтрокаТЗ); 
					МассивСоответствийСтрокТЗ.Добавить(СлепокСтруктуры);
				КонецЦикла;  
				Для каждого СвойствоСтроки из МассивСоответствийСтрокТЗ цикл
					Для каждого ИмяСвойстваСтроки из 	Элем.Значение[Подэлем.Имя].Колонки цикл
						СвойствоСтроки[ИмяСвойстваСтроки.Имя] = Строка(СвойствоСтроки[ИмяСвойстваСтроки.Имя]);	
					КонецЦикла;
				КонецЦикла;
				
					
				Элем.Значение[Подэлем.Имя] = МассивСоответствийСтрокТЗ;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры   

Процедура ИсключитьСвойства(ИтоговыйСтруктура, Исключения) Экспорт
	Для каждого Элем из ИтоговыйСтруктура цикл
		Для каждого Подэлем из Исключения цикл
			Элем.Значение.Удалить(Подэлем);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция ПрочитатьТелоJSON(Запрос, ТелоКакСтрока) Экспорт
 	Чтение = новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТелоКакСтрока);
	Данные = ПрочитатьJSON(Чтение, Ложь);
	
	Возврат Данные;
КонецФункции